IntergatedCircuits/STM32_XPD/STM32L4_XPD/src/xpd_adc.c
/**
  ******************************************************************************
  * @file    xpd_adc.c
  * @author  Benedek Kupper
  * @version 0.3
  * @date    2018-01-28
  * @brief   STM32 eXtensible Peripheral Drivers Analog Digital Converter Module
  *
  * Copyright (c) 2018 Benedek Kupper
  *
  * Licensed under the Apache License, Version 2.0 (the "License");
  * you may not use this file except in compliance with the License.
  * You may obtain a copy of the License at
  *
  *     http://www.apache.org/licenses/LICENSE-2.0
  *
  * Unless required by applicable law or agreed to in writing, software
  * distributed under the License is distributed on an "AS IS" BASIS,
  * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
  * See the License for the specific language governing permissions and
  * limitations under the License.
  */

#include <xpd_adc.h>
#include <xpd_rcc.h>
#include <xpd_utils.h>

/** @addtogroup ADC
 * @{ */

/** @addtogroup ADC_Core
 * @{ */

#define ADC_STAB_DELAY_US           10
#define ADC_TEMPSENSOR_DELAY_US     120
#define ADC_CALIBRATION_TIMEOUT     10
#define ADC_CONVERSION_TIME_MAX_CPU_CYCLES ((uint32_t) 156928)
#define ADC_STOP_CONVERSION_TIMEOUT 5

#define ADC_STARTCTRL           (ADC_CR_ADSTART | ADC_CR_JADSTART)
#define ADC_STOPCTRL            (ADC_CR_ADSTP | ADC_CR_JADSTP)
#define ADC_ENDFLAG_SEQUENCE    (ADC_IER_EOSIE | ADC_IER_JEOSIE)
#define ADC_ENDFLAG_CONVERSION  (ADC_IER_EOCIE | ADC_IER_JEOCIE)

#define ADC_SQR_MASK            (ADC_SQR1_SQ1 >> ADC_SQR1_SQ1_Pos)
#define ADC_SQR_SIZE            (ADC_SQR1_SQ2_Pos - ADC_SQR1_SQ1_Pos)
#define ADC_SQR_REGDIR          (1)

#if (ADC_COUNT > 1)

#define ADC_PAIR(HANDLE) \
    ((ADC_TypeDef *)(((uint32_t)(HANDLE)->Inst) ^ 0x100))

#define ADC_MULTI_CFGR(HANDLE, DUAL)    \
    (((DUAL) == ADC_MULTIMODE_SINGE) || (IS_ADC_MULTIMODE_MASTER_INSTANCE((HANDLE)->Inst))) ? \
        (HANDLE)->Inst->CFGR.w : ADC_PAIR(HANDLE)->CFGR.w)

#else

#define ADC_PAIR(HANDLE) NULL

#define ADC_MULTI_CFGR(HANDLE, DUAL)    \
    ((HANDLE)->Inst->CFGR.w)

#endif

#if (ADC_COUNT > 1)
static volatile uint8_t adc_aucUsers[] = {
        0
};

/* Enables the peripheral clock in RCC */
static void ADC_prvClockEnable(ADC_HandleType * pxADC)
{
    uint8_t ucAdcx = ADC_INDEX(pxADC);
    uint8_t ucIndex = 0;

    if (adc_aucUsers[ucIndex] == 0)
    {
        RCC_vClockEnable(RCC_POS_ADC + ucIndex);
    }

    SET_BIT(adc_aucUsers[ucIndex], 1 << ucAdcx);
}

/* Disables the peripheral clock in RCC when neither ADCs are used */
static void ADC_prvClockDisable(ADC_HandleType * pxADC)
{
    uint8_t ucAdcx = ADC_INDEX(pxADC);
    uint8_t ucIndex = 0;

    CLEAR_BIT(adc_aucUsers[ucIndex], 1 << ucAdcx);

    if (adc_aucUsers[ucIndex] == 0)
    {
        RCC_vClockDisable(RCC_POS_ADC + ucIndex);
    }
}

#else
#define ADC_prvClockEnable(HANDLE)    (RCC_vClockEnable(RCC_POS_ADC))
#define ADC_prvClockDisable(HANDLE)   (RCC_vClockDisable(RCC_POS_ADC))
#endif

/* Returns the ADC pair's relevant CFGR register value */
__STATIC_INLINE uint32_t ADC_prvGetMultiCfgr(ADC_HandleType * pxADC, uint32_t ulDual)
{
    uint32_t ulCFGR;
#if (ADC_COUNT > 1)
    /* Get relevant register CFGR in ADC instance of ADC master or slave
     * in function of multimode state (for devices with multimode available). */
    if (    (ulDual != ADC_MULTIMODE_SINGE)
         && (!IS_ADC_MULTIMODE_MASTER_INSTANCE(pxADC->Inst)))
    {
        ulCFGR = ADC_PAIR(pxADC)->CFGR.w;
    }
    else
#endif
    {
        ulCFGR = pxADC->Inst->CFGR.w;
    }
    return ulCFGR;
}

static void ADC_prvDmaConversionRedirect(void *pxDMA)
{
    ADC_HandleType* pxADC = (ADC_HandleType*) ((DMA_HandleType*) pxDMA)->Owner;

    XPD_SAFE_CALLBACK(pxADC->Callbacks.ConvComplete, pxADC);
}

#ifdef __XPD_DMA_ERROR_DETECT
static void ADC_prvDmaErrorRedirect(void *pxDMA)
{
    ADC_HandleType* pxADC = (ADC_HandleType*) ((DMA_HandleType*) pxDMA)->Owner;

    /* Update error code */
    pxADC->Errors |= ADC_ERROR_DMA;

    XPD_SAFE_CALLBACK(pxADC->Callbacks.Error, pxADC);
}
#endif

/* Enables the peripheral */
static boolean_t ADC_prvEnableInst(ADC_TypeDef * ADCx)
{
    /* Requirements:
     * ADCAL, ADSTP, JADSTP, ADSTART, JADSTART, ADDIS, ADEN = 0 */
    boolean_t eSuccess = (0 == (ADCx->CR.w & (ADC_CR_ADEN | ADC_STARTCTRL
            | ADC_STOPCTRL | ADC_CR_ADCAL | ADC_CR_ADDIS)));
    if (eSuccess)
    {
        SET_BIT(ADCx->CR.w, ADC_CR_ADEN);
    }
    return eSuccess;
}

/* Disables the peripheral */
static void ADC_prvDisableInst(ADC_TypeDef * ADCx)
{
    /* Requirements:
     * ADEN = 1, ADSTART, JADSTART = 0 */
    if (ADC_CR_ADEN == (ADCx->CR.w & (ADC_CR_ADEN | ADC_STARTCTRL)))
    {
        SET_BIT(ADCx->CR.w, ADC_CR_ADDIS);
        SET_BIT(ADCx->ISR.w, ADC_ISR_EOSMP | ADC_ISR_ADRDY);
    }
}

/* Sets the sample time for a channel configuration */
static void ADC_prvSampleTimeConfig(ADC_HandleType * pxADC, const ADC_ChannelInitType * pxChannel)
{
    __IO uint32_t *pulSMPR = &pxADC->Inst->SMPR1.w;
    uint32_t ulNumber = pxChannel->Number;

    /* Channel sampling time configuration */
    if (ulNumber > 10)
    {
        pulSMPR = &pxADC->Inst->SMPR2.w;
        ulNumber -= 10;
    }
    ulNumber *= 3;

    /* set the sample time */
    MODIFY_REG(*pulSMPR, ADC_SMPR1_SMP0 << ulNumber, pxChannel->SampleTime << ulNumber);

#ifdef ADC_SMPR1_SMPPLUS
    /* If sample time is either 2.5 or 3.5, update ADC-wide setting */
    if ((pxChannel->SampleTime & 7) == 0)
    {
        ADC_REG_BIT(pxADC, SMPR1, SMPPLUS) = pxChannel->SampleTime >> 3;
    }
#endif
}

/* Sets the oversampling configuration of the ADC */
static void ADC_prvOversamplingConfig(ADC_HandleType * pxADC, const ADC_OversamplingType * pxConfig)
{
    pxADC->Inst->CFGR2.b.OVSS  = pxConfig->RightShift;
    pxADC->Inst->CFGR2.b.OVSR  = pxConfig->Ratio;
    pxADC->Inst->CFGR2.b.ROVSM = pxConfig->RestartOnInject;
    pxADC->Inst->CFGR2.b.TROVS = pxConfig->DiscontinuousMode;
}

/* Enables an internal channel for conversion */
static void ADC_prvInitInternalChannel(ADC_HandleType * pxADC, uint8_t ucChannel)
{
    uint32_t ulChBit = 0;

    /* Map channel to enable bit */
    switch (ucChannel)
    {
        case ADC1_VBAT_CHANNEL:
            /* enable the VBAT input */
#if (ADC_COUNT > 1)
            if (pxADC->Inst != ADC2)
#endif
            { ulChBit = ADC_CCR_VBATEN; }
            break;

        case ADC1_VREFINT_CHANNEL:
#if (ADC_COUNT > 1)
            if (pxADC->Inst == ADC1)
#endif
            /* enable the VREF input */
            { ulChBit = ADC_CCR_VREFEN; }
            break;

        case ADC1_TEMPSENSOR_CHANNEL:
            /* enable the TS input */
#if (ADC_COUNT > 1)
            if (pxADC->Inst != ADC2)
#endif
            { ulChBit = ADC_CCR_TSEN; }
            break;

        default:
            break;
    }

