IntergatedCircuits/STM32_XPD/STM32L4_XPD/src/xpd_adc.c
    /* Reset register CFGR */
    pxADC->Inst->CFGR.w = 0;
    pxADC->Inst->CFGR2.w = 0;

    /* Deinitialize peripheral dependencies */
    XPD_SAFE_CALLBACK(pxADC->Callbacks.DepDeinit, pxADC);

    /* disable clock */
    ADC_prvClockDisable(pxADC);
}

/**
 * @brief Initializes the regular ADC channels for conversion using the setup configuration.
 * @param pxADC: pointer to the ADC handle structure
 * @param axChannels: ADC regular channel configuration array pointer
 * @param ucChannelCount: number of channels to configure
 */
void ADC_vChannelConfig(
        ADC_HandleType *            pxADC,
        const ADC_ChannelInitType   axChannels[],
        uint8_t                     ucChannelCount)
{
    /* No regular conversion ongoing */
    if (ADC_REG_BIT(pxADC, CR, ADSTART) == 0)
    {
        uint8_t i, ucAWD1Chs = 0;
        uint32_t ulSeqOffset = ADC_SQR1_SQ1_Pos;
        __IO uint32_t *pulSQR = &pxADC->Inst->SQR1.w;

        /* Sequencer configuration */
        for (i = 0; i < ucChannelCount; i++)
        {
            MODIFY_REG(*pulSQR, ADC_SQR_MASK << ulSeqOffset,
                    axChannels[i].Number << ulSeqOffset);

            /* Advance to next sequence element */
            ulSeqOffset += ADC_SQR_SIZE;

            /* Jump to next register when the current one is filled */
            if (ulSeqOffset > (32 - ADC_SQR_SIZE))
            {
                pulSQR += ADC_SQR_REGDIR;
                ulSeqOffset = 0;
            }
        }

        /* Forward to channel common configurator */
        ucAWD1Chs = ADC_prvCommonChannelConfig(pxADC, axChannels, ucChannelCount);

        /* Configuration of AWD1 */
        if ((pxADC->Inst->CR.w & ADC_STARTCTRL) == 0)
        {
            uint32_t ulClrMask = ADC_CFGR_AWD1SGL;
            uint32_t ulSetMask = 0;

            if (ucAWD1Chs == 0)
            {
                ulClrMask = ADC_CFGR_AWD1EN | ADC_CFGR_AWD1SGL;
            }
            else
            {
                ulSetMask = ADC_CFGR_AWD1EN;

                if (ucAWD1Chs == 1)
                {
                    /* In case of a single channel, set SGL flag
                     * AWD1CH is set in common configurator */
                    ulSetMask = ADC_CFGR_AWD1EN | ADC_CFGR_AWD1SGL;
                }

                /* Disable other group's watchdog if it targeted a single channel */
                if ((pxADC->Inst->CFGR.w & (ADC_CFGR_AWD1SGL | ADC_CFGR_JAWD1EN)) ==
                                           (ADC_CFGR_AWD1SGL | ADC_CFGR_JAWD1EN))
                {
                    ulClrMask = ADC_CFGR_JAWD1EN;
                }
            }
            pxADC->Inst->CFGR.w = (pxADC->Inst->CFGR.w & (~ulClrMask)) | ulSetMask;
        }

        /* Init() sets this variable as flag to indicate ScanMode */
        if (pxADC->ConversionCount > 0)
        {
            pxADC->ConversionCount = ucChannelCount;

            /* Set number of ranks in regular group sequencer */
            pxADC->Inst->SQR1.b.L = pxADC->ConversionCount - 1;
        }
        else
        {
            pxADC->Inst->SQR1.b.L = 0;
        }
    }
}

/**
 * @brief Enables the ADC peripheral and starts conversion if the trigger is software.
 * @param pxADC: pointer to the ADC handle structure
 */
void ADC_vStart(ADC_HandleType * pxADC)
{
    /* Success if not started */
    if (ADC_REG_BIT(pxADC, CR, ADSTART) == 0)
    {
        /* ADC turn ON */
        if (ADC_prvEnableInst(pxADC->Inst))
        {
            /* Wait until ADRDY flag is set ( < 1us) */
            uint32_t ulTimeout = 1;
            XPD_eWaitForMatch(&pxADC->Inst->ISR.w, ADC_ISR_ADRDY, ADC_ISR_ADRDY, &ulTimeout);
        }

        /* clear regular group conversion flag and overrun flag */
        SET_BIT(pxADC->Inst->ISR.w, ADC_ISR_EOC | ADC_ISR_EOS | ADC_ISR_OVR);

#if (ADC_COUNT > 1)
        /* if ADC is either not in multimode, or the multimode master,
         * enable software conversion of regular channels */
        if (    (ADC_COMMON(pxADC)->CCR.b.DUAL == ADC_MULTIMODE_SINGE)
             || (IS_ADC_MULTIMODE_MASTER_INSTANCE(pxADC->Inst)))
#endif
        {
            ADC_REG_BIT(pxADC, CR, ADSTART) = 1;
        }

#if defined(__XPD_ADC_ERROR_DETECT) || defined(__XPD_DMA_ERROR_DETECT)
        pxADC->Errors = ADC_ERROR_NONE;
#endif
    }
}

/**
 * @brief Stops the ADC peripheral.
 * @param pxADC: pointer to the ADC handle structure
 */
void ADC_vStop(ADC_HandleType * pxADC)
{
    uint32_t ulTimeout = 1;

    /* 1. Stop potential ongoing conversions */
    ADC_prvStopConversion(pxADC, ADC_STARTCTRL);

    ADC_prvDisableInst(pxADC->Inst);

    XPD_eWaitForMatch(&pxADC->Inst->ISR.w, ADC_ISR_ADRDY, 0, &ulTimeout);
}

/**
 * @brief Polls the status of the ADC operation(s).
 * @param pxADC: pointer to the ADC handle structure
 * @param eOperation: the type of operation to check
 * @param ulTimeout: the timeout in ms for the polling.
 * @return ERROR if there was an input error, TIMEOUT if timed out, OK if successful
 */
XPD_ReturnType ADC_ePollStatus(
        ADC_HandleType *    pxADC,
        ADC_OperationType   eOperation,
        uint32_t            ulTimeout)
{
    XPD_ReturnType eResult = XPD_OK;

    if (    (eOperation == ADC_OPERATION_CONVERSION)
         && ((pxADC->EndFlagSelection & ADC_IER_EOSIE) != 0))
    {
        eOperation = ADC_ISR_EOS;
    }
    else if (    (eOperation == ADC_OPERATION_INJCONVERSION)
              && ((pxADC->EndFlagSelection & ADC_IER_JEOSIE) != 0))
    {
        eOperation = ADC_ISR_JEOS;
    }

    /* Polling for single conversion is not allowed when DMA is used,
     * and EOC is raised on end of single conversion */
    if (eOperation == ADC_OPERATION_CONVERSION)
    {
#if (ADC_COUNT > 1)
        /* If multimode used, check common DMA config, otherwise dedicated DMA config */
        if (ADC_COMMON_REG_BIT(pxADC, CCR, DUAL) != 0)
        {
            if (ADC_COMMON_REG_BIT(pxADC, CCR, MDMA) == 1)
            { eResult = XPD_ERROR; }
        }
        else
#endif
        {
            if (ADC_REG_BIT(pxADC, CFGR, DMAEN) == 1)
            { eResult = XPD_ERROR; }
        }
    }

    if (eResult == XPD_OK)
    {
        /* Wait until operation flag is set */
        eResult = XPD_eWaitForMatch(&pxADC->Inst->ISR.w, eOperation, eOperation, &ulTimeout);

