IntergatedCircuits/STM32_XPD/STM32L4_XPD/src/xpd_adc.c
        /* Clear end of conversion flag of regular group if low power feature
         * "LowPowerAutoWait " is disabled, to not interfere with this feature
         * until data register is read. */
        if ((eResult == XPD_OK) && ((eOperation & (ADC_ISR_EOC | ADC_ISR_EOS)) != 0)
             && (ADC_REG_BIT(pxADC, CFGR, AUTDLY) == 0))
        {
            SET_BIT(pxADC->Inst->ISR.w, eOperation);
        }
    }
    return eResult;
}

/**
 * @brief Enables the ADC peripheral and interrupts, and starts conversion
 *        if the trigger is software.
 * @param pxADC: pointer to the ADC handle structure
 */
void ADC_vStart_IT(ADC_HandleType * pxADC)
{
    /* Choose interrupt source based on EOC config */
    uint32_t ulITs = pxADC->EndFlagSelection;

#ifdef __XPD_ADC_ERROR_DETECT
    /* ADC overrun and end of conversion interrupt for regular group */
    ulITs |= ADC_IER_OVRIE;
#endif

    MODIFY_REG(pxADC->Inst->IER.w, (ADC_IER_EOCIE | ADC_IER_EOSIE | ADC_IER_OVRIE), ulITs);

    ADC_vStart(pxADC);
}

/**
 * @brief Stops the ADC peripheral and disables interrupts.
 * @param pxADC: pointer to the ADC handle structure
 */
void ADC_vStop_IT(ADC_HandleType * pxADC)
{
    ADC_vStop(pxADC);

    /* ADC end of conversion interrupt for regular and injected group */
    CLEAR_BIT(pxADC->Inst->IER.w, pxADC->EndFlagSelection | ADC_IER_OVRIE);
}

/**
 * @brief ADC interrupt handler that provides handle callbacks.
 * @param pxADC: pointer to the ADC handle structure
 */
void ADC_vIRQHandler(ADC_HandleType * pxADC)
{
    uint32_t ulISR = pxADC->Inst->ISR.w;
    uint32_t ulIER = pxADC->Inst->IER.w;
#if (ADC_COUNT > 1)
    uint32_t ulDual = ADC_COMMON(pxADC)->CCR.b.DUAL;
#else
    uint32_t ulDual = 0;
#endif

    /* End of conversion flag for regular channels */
    if (    ((ulISR & (ADC_ISR_EOC | ADC_ISR_EOS)) != 0)
         && ((ulIER & (ADC_IER_EOCIE | ADC_IER_EOSIE)) != 0))
    {
        uint32_t ulCFGR = ADC_prvGetMultiCfgr(pxADC, ulDual);

        /* If the conversion is not continuous / external triggered */
        if ((ulCFGR & (ADC_CFGR_CONT | ADC_CFGR_EXTEN)) == 0)
        {
            /* End of sequence */
            if (((ulISR & ADC_ISR_EOS) != 0) && (ADC_REG_BIT(pxADC, CR, ADSTART) == 0))
            {
                /* Disable the ADC end of conversion interrupt for regular group */
                CLEAR_BIT(pxADC->Inst->IER.w, ADC_IER_EOCIE | ADC_IER_EOSIE);
            }
        }

        /* Clear the ADC flag for regular end of conversion */
        SET_BIT(pxADC->Inst->ISR.w, ADC_ISR_EOC | ADC_ISR_EOS);

        /* Conversion complete callback */
        XPD_SAFE_CALLBACK(pxADC->Callbacks.ConvComplete, pxADC);
    }

    /* End of conversion flag for injected channels */
    if (    ((ulISR & (ADC_ISR_JEOC | ADC_ISR_JEOS)) != 0)
         && ((ulIER & (ADC_IER_JEOCIE | ADC_IER_JEOSIE)) != 0))
    {
        uint32_t ulCFGR = ADC_prvGetMultiCfgr(pxADC, ulDual);

        /* Injected conversion is not continuous or not automatic,
         * and software triggered */
        if (    (pxADC->Inst->JSQR.b.JEXTEN == 0)
             || (    ((ulCFGR & ADC_CFGR_CONT) == 0)
                  && (pxADC->Inst->CFGR.b.EXTEN == 0)
                  && (pxADC->Inst->CFGR.b.JAUTO == 0)))
        {
            /* End of sequence */
            if ((ulISR & ADC_ISR_JEOS) != 0)
            {
#if (ADC_COUNT > 1)
                if (!(    (ulDual == ADC_MULTIMODE_SINGE)
                       || (ulDual == ADC_MULTIMODE_DUAL_REGSIMULT)
                       || (ulDual == ADC_MULTIMODE_DUAL_INTERLEAVED)
                       || (IS_ADC_MULTIMODE_MASTER_INSTANCE(pxADC->Inst))))
                {
                    ulCFGR = ADC_PAIR(pxADC)->CFGR.w;
                }
                else
#endif
                {
                    ulCFGR = pxADC->Inst->CFGR.w;
                }

                if ((ulCFGR & ADC_CFGR_JQM) == 0)
                {
                    if (ADC_REG_BIT(pxADC, CR, JADSTART) == 0)
                    {
                        /* disable the ADC end of conversion interrupt
                         * for injected group */
                        CLEAR_BIT(pxADC->Inst->IER.w, ADC_IER_JEOC | ADC_IER_JEOS);
                    }
                }
            }
        }
        /* clear the ADC flag for injected end of conversion */
        SET_BIT(pxADC->Inst->ISR.w, ADC_ISR_JEOC | ADC_ISR_JEOS);

        /* injected conversion complete callback */
        XPD_SAFE_CALLBACK(pxADC->Callbacks.InjConvComplete, pxADC);
    }

    /* Check analog watchdog flag */
    if (    ((ulISR & ADC_ISR_AWD1) != 0)
         && ((ulIER & ADC_IER_AWD1IE) != 0))
    {
        pxADC->ActiveWatchdog = ADC_AWD1;

        /* watchdog callback */
        XPD_SAFE_CALLBACK(pxADC->Callbacks.Watchdog, pxADC);

        /* clear the watchdog flag only after callback,
         * so watchdog status can be determined */
        ADC_FLAG_CLEAR(pxADC, AWD1);
    }
    if (    ((ulISR & ADC_ISR_AWD2) != 0)
         && ((ulIER & ADC_IER_AWD2IE) != 0))
    {
        pxADC->ActiveWatchdog = ADC_AWD2;

        /* watchdog callback */
        XPD_SAFE_CALLBACK(pxADC->Callbacks.Watchdog, pxADC);

        /* clear the watchdog flag only after callback,
         * so watchdog status can be determined */
        ADC_FLAG_CLEAR(pxADC, AWD2);
    }
    if (    ((ulISR & ADC_ISR_AWD3) != 0)
         && ((ulIER & ADC_IER_AWD3IE) != 0))
    {
        pxADC->ActiveWatchdog = ADC_AWD3;

        /* watchdog callback */
        XPD_SAFE_CALLBACK(pxADC->Callbacks.Watchdog, pxADC);

        /* clear the watchdog flag only after callback,
         * so watchdog status can be determined */
        ADC_FLAG_CLEAR(pxADC, AWD3);
    }

#ifdef __XPD_ADC_ERROR_DETECT
    /* Check Overrun flag */
    if (    ((ulISR & ADC_ISR_OVR) != 0)
         && ((ulIER & ADC_IER_OVRIE) != 0))
    {
        /* Update error code */
        pxADC->Errors |= ADC_ERROR_OVERRUN;

        /* Clear the Overrun flag */
        ADC_FLAG_CLEAR(pxADC, OVR);
    }
    /* Check Injected Overrun flag */
    if (    ((ulISR & ADC_ISR_JQOVF) != 0)
         && ((ulIER & ADC_IER_JQOVFIE) != 0))
    {
        /* Update error code */
        pxADC->Errors |= ADC_ERROR_JQOVF;

        /* Clear the Overrun flag */
        ADC_FLAG_CLEAR(pxADC, JQOVF);
    }

    if (pxADC->Errors != ADC_ERROR_NONE)
    {
        /* Error callback */
        XPD_SAFE_CALLBACK(pxADC->Callbacks.Error, pxADC);
    }
#endif
}

/**
 * @brief Sets up and enables a DMA transfer for the ADC regular conversions.
 * @param pxADC: pointer to the ADC handle structure
 * @param pvAddress: memory address to the conversion data storage
 * @return BUSY if the DMA is used by other peripheral, OK otherwise
 */
XPD_ReturnType ADC_eStart_DMA(ADC_HandleType * pxADC, void * pvAddress)
{
    XPD_ReturnType eResult = XPD_ERROR;

#if (ADC_COUNT > 1)
    /* If multimode is used, multimode function shall be used */
    if (ADC_COMMON(pxADC)->CCR.b.DUAL == ADC_MULTIMODE_SINGE)
#endif
    {
        /* Set up DMA for transfer */
        eResult = DMA_eStart_IT(pxADC->DMA.Conversion,
                (void *)&pxADC->Inst->DR, pvAddress, pxADC->Inst->SQR1.b.L + 1);

        /* If the DMA is currently used, return with error */
        if (eResult == XPD_OK)
        {
            /* Set the callback owner */
            pxADC->DMA.Conversion->Owner = pxADC;

            /* Set the DMA transfer callbacks */
            pxADC->DMA.Conversion->Callbacks.Complete     = ADC_prvDmaConversionRedirect;
#ifdef __XPD_DMA_ERROR_DETECT
            pxADC->DMA.Conversion->Callbacks.Error        = ADC_prvDmaErrorRedirect;
#endif

#ifdef __XPD_ADC_ERROR_DETECT
            /* Enable ADC overrun interrupt */
            ADC_IT_ENABLE(pxADC, OVR);
#endif

