IntergatedCircuits/STM32_XPD/STM32L4_XPD/src/xpd_adc.c
            /* Enable ADC DMA mode */
            ADC_REG_BIT(pxADC, CFGR, DMAEN) = 1;

            ADC_vStart(pxADC);
        }
    }

    return eResult;
}

/**
 * @brief Disables the ADC and its DMA transfer.
 * @param pxADC: pointer to the ADC handle structure
 */
void ADC_vStop_DMA(ADC_HandleType * pxADC)
{
    /* Disable the Peripheral */
    ADC_vStop(pxADC);

#ifdef __XPD_ADC_ERROR_DETECT
    /* Disable ADC overrun interrupt */
    ADC_IT_DISABLE(pxADC, OVR);
#endif
    /* Disable the selected ADC DMA mode */
    ADC_REG_BIT(pxADC, CFGR, DMAEN) = 0;

    /* Disable the ADC DMA Stream */
    DMA_vStop_IT(pxADC->DMA.Conversion);
}

/**
 * @brief Initializes the analog watchdog using the setup configuration.
 * @param pxADC: pointer to the ADC handle structure
 * @param eWatchdog: the analog watchdog selection
 * @param usLowThd: low threshold of the watchdog
 * @param usHighThd: high threshold of the watchdog
 */
void ADC_vWatchdogConfig(
        ADC_HandleType *    pxADC,
        ADC_WatchdogType    eWatchdog,
        uint16_t            usLowThd,
        uint16_t            usHighThd)
{
    /* Configure when ADC is stopped */
    if ((eWatchdog != ADC_AWD_NONE) && ((pxADC->Inst->CR.w & ADC_STARTCTRL) == 0))
    {
        uint32_t ulScaling   = pxADC->Inst->CFGR.b.RES * 2;
        __IO uint32_t *pulTR = (&pxADC->Inst->TR1.w + eWatchdog - ADC_AWD1);

        /* Analog watchdogs configuration */
        if (eWatchdog == ADC_AWD1)
        {
            /* Shift the offset in function of the selected ADC resolution:
             * Thresholds have to be left-aligned on bit 11, the LSB (right bits)
             * are set to 0 */
            *pulTR = (usHighThd  << (16 + ulScaling)) | (usLowThd  << ulScaling);
        }
        else
        {
            /* Shift the threshold in function of the selected ADC resolution
             * have to be left-aligned on bit 7, the LSB (right bits) are set to 0 */
            if (ulScaling < 5)
            {
                *pulTR = (usHighThd  << (20 - ulScaling)) | (usLowThd  << (4 - ulScaling));
            }
            else
            {
                *pulTR = (usHighThd  << (20 - ulScaling)) | (usLowThd  >> (ulScaling - 4));
            }
        }
    }
}

/**
 * @brief Returns the currently active analog watchdog.
 * @param pxADC: pointer to the ADC handle structure
 * @return The watchdog number if an active watchdog triggered an interrupt, 0 otherwise
 */
ADC_WatchdogType ADC_eWatchdogStatus(ADC_HandleType * pxADC)
{
    /* Update the active watchdog variable with current flag status */
    pxADC->ActiveWatchdog *= pxADC->Inst->ISR.w >> (pxADC->ActiveWatchdog + ADC_ISR_AWD1_Pos - 1);
    return pxADC->ActiveWatchdog;
}

/** @} */

/** @} */

/** @addtogroup ADC_Injected
 * @{ */

/** @defgroup ADC_Injected_Exported_Functions ADC Injected Exported Functions
 * @{ */

/**
 * @brief Initializes a injected ADC channel for conversion using the setup configuration.
 * @param pxADC: pointer to the ADC handle structure
 * @param pxConfig: pointer to ADC injected channel setup configuration
 */
void ADC_vInjectedInit(ADC_HandleType * pxADC, const ADC_InjectedInitType * pxConfig)
{
    /* Save trigger configuration into context queue */
    if (pxConfig->Trigger.InjSource != ADC_INJTRIGGER_SOFTWARE)
    {
        pxADC->InjectedConfig =
                (pxConfig->Trigger.InjSource << ADC_JSQR_JEXTSEL_Pos) |
                (pxConfig->Trigger.Edge      << ADC_JSQR_JEXTEN_Pos);
    }
    else
    {
        pxADC->InjectedConfig = 0;
    }

    /* Set configuration that is restricted to no ongoing injected conversions */
    if (ADC_REG_BIT(pxADC, CR, JADSTART) == 0)
    {
        pxADC->Inst->CFGR.b.JQM     = pxConfig->ContextQueue;
        pxADC->Inst->CFGR.b.JDISCEN = pxConfig->DiscontinuousMode & (!pxConfig->AutoInjection);

        /* Set configuration that is restricted to no ongoing conversions */
        if ((pxADC->Inst->CR.w & ADC_STARTCTRL) == 0)
        {
            /* Auto-injection is triggered by end of regular group conversion,
             * external triggers are not allowed */
            {
                pxADC->Inst->CFGR.b.JAUTO = pxConfig->AutoInjection;
            }

            /* Set oversampling mode configuration */
            if (pxConfig->Oversampling.State == ENABLE)
            {
                ADC_prvOversamplingConfig(pxADC, &pxConfig->Oversampling);
            }
            ADC_REG_BIT(pxADC, CFGR2, JOVSE) = pxConfig->Oversampling.State;
        }
    }
}

/**
 * @brief Initializes the injected ADC channels for conversion using the setup configuration.
 * @param pxADC: pointer to the ADC handle structure
 * @param axChannels: ADC injected channel configuration array pointer
 * @param ucChannelCount: number of channels to configure
 */
void ADC_vInjectedChannelConfig(
        ADC_HandleType *            pxADC,
        const ADC_ChannelInitType   axChannels[],
        uint8_t                     ucChannelCount)
{
    uint8_t i, ucAWD1Chs;
    uint32_t ulSeqOffset = ADC_JSQR_JSQ1_Pos, ulJSQR = 0;

    /* Forward to channel common configurator */
    ucAWD1Chs = ADC_prvCommonChannelConfig(pxADC, axChannels, ucChannelCount);

    /* Configuration of AWD1 */
    if ((pxADC->Inst->CR.w & ADC_STARTCTRL) == 0)
    {
        uint32_t ulClrMask = ADC_CFGR_AWD1SGL;
        uint32_t ulSetMask = 0;

        if (ucAWD1Chs == 0)
        {
            ulClrMask = ADC_CFGR_JAWD1EN | ADC_CFGR_AWD1SGL;
        }
        else
        {
            ulSetMask = ADC_CFGR_JAWD1EN;

            if (ucAWD1Chs == 1)
            {
                /* In case of a single channel, set SGL flag
                 * AWD1CH is set in common configurator */
                ulSetMask = ADC_CFGR_JAWD1EN | ADC_CFGR_AWD1SGL;
            }

            /* Disable other group's watchdog if it targeted a single channel */
            if ((pxADC->Inst->CFGR.w & (ADC_CFGR_AWD1SGL | ADC_CFGR_AWD1EN)) ==
                                       (ADC_CFGR_AWD1SGL | ADC_CFGR_AWD1EN))
            {
                ulClrMask = ADC_CFGR_AWD1EN;
            }
        }
        pxADC->Inst->CFGR.w = (pxADC->Inst->CFGR.w & (~ulClrMask)) | ulSetMask;
    }

