IntergatedCircuits/STM32_XPD/STM32L4_XPD/src/xpd_adc.c
            /* Enable ADC DMA mode */
            ADC_REG_BIT(pxADC, CFGR, DMAEN) = 1;

            ADC_vStart(pxADC);
        }
    }

    return eResult;
}

/**
 * @brief Disables the ADC and the common DMA transfer.
 * @param pxADC: pointer to the ADC handle structure
 */
void ADC_vMultiModeStop_DMA(ADC_HandleType * pxADC)
{
    ADC_TypeDef *pxPair = ADC_PAIR(pxADC);
    uint32_t ulTimeout = ADC_STOP_CONVERSION_TIMEOUT;

    ADC_vStop_DMA(pxADC);

    /* Wait for effective finish of slave conversion */
    if (XPD_OK == XPD_eWaitForMatch(&pxPair->CR.w, ADC_CR_ADSTART, 0, &ulTimeout))
    {
        /* disable pair */
        ADC_prvDisableInst(pxPair);
    }
}

/** @} */

/** @} */
#endif

/** @addtogroup ADC_Calibration
 * @{ */

/** @defgroup ADC_Calibration_Exported_Functions ADC Calibration Exported Functions
 * @{ */

/**
 * @brief Executes an ADC self-calibration sequence.
 * @param pxADC: pointer to the ADC handle structure
 * @param eDifferential: differential mode calibration flag
 * @return Result of the operation
 */
XPD_ReturnType ADC_eCalibrate(ADC_HandleType * pxADC, boolean_t eDifferential)
{
    XPD_ReturnType eResult = XPD_ERROR;

    /* Calibration prerequisite: ADC must be disabled. */
    if (ADC_REG_BIT(pxADC, CR, ADEN) == 0)
    {
        uint32_t ulTimeout = ADC_CALIBRATION_TIMEOUT;

        /* Select calibration mode single ended or differential ended */
        ADC_REG_BIT(pxADC, CR, ADCALDIF) = eDifferential;

        /* Start ADC calibration */
        ADC_REG_BIT(pxADC, CR, ADCAL) = 1;

        /* Wait for ADCAL to return to 0 */
        eResult = XPD_eWaitForDiff(&pxADC->Inst->CR.w,
                ADC_CR_ADCAL, ADC_CR_ADCAL, &ulTimeout);
    }
    return eResult;
}

/** @} */

/** @} */

/** @} */
